In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('players_20.csv')
df.set_index('short_name',inplace=True)
df = df.iloc[:,2:9]

In [4]:
df.head()

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus
Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain
J. Oblak,Jan Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid
E. Hazard,Eden Hazard,28,1991-01-07,175,74,Belgium,Real Madrid

### Copy method

1.1 Deep parameter = True

In [6]:
# df_copy is copy of df. with default value of deep = True, any change to this file will not be reflected to copied file
df_copy = df.copy()

1.2 Deep parameter = False

In [9]:
# with deep = false, any change to original file will reflect in the copy df
df_copy_new = df.copy(deep=False)

In [12]:
df.iloc[1,2] = 34

# copied df
df_copy_new.head()

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,34,187,83,Portugal,Juventus
Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain
J. Oblak,Jan Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid
E. Hazard,Eden Hazard,28,1991-01-07,175,74,Belgium,Real Madrid

1.3 Simple assignment

In [ ]:
#  simple way to make copy but here any change made to the parent file will be reflect in the copied file 
df_copy_3 = df

In [16]:
# change made to any of the file will be reflect in other one, in simple words, both files are independent on each other.
df_copy_3.iloc[1,3]=50
df.head()

,long_name,age,dob,height_cm,weight_kg,nationality,club
short_name,,,,,,,
L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona
Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,34,50,83,Portugal,Juventus
Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain
J. Oblak,Jan Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid
E. Hazard,Eden Hazard,28,1991-01-07,175,74,Belgium,Real Madrid

### Practice Exercise

Exercise 1:

# Create a sample DataFrame first
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'age': [25, 30, 35, 28],
    'city': ['New York', 'London', 'Tokyo', 'Paris'],
    'salary': [50000, 60000, 70000, 55000]
}

df = pd.DataFrame(data)

df.set_index('name', inplace=True)

Task 1: Create a deep copy and modify the original

     1. Create a deep copy called df_deep

     2. Change Alice's age to 26 in the original DataFrame

     3. Print both DataFrames to observe the difference

In [79]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'age': [25, 30, 35, 28],
    'city': ['New York', 'London', 'Tokyo', 'Paris'],
    'salary': [50000, 60000, 70000, 55000]
}
df_1 = pd.DataFrame(data)
df_1.set_index('name',inplace=True)
df_1

         age      city  salary
name
Alice     25  New York   50000
Bob       30    London   60000
Charlie   35     Tokyo   70000
Diana     28     Paris   55000

In [51]:
#1
deep_copy = df_1.copy()

In [52]:
df_1.iloc[1,2]='50'
deep_copy

C:\Users\parde\AppData\Local\Temp\ipykernel_19352\3792558957.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '50' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df_1.iloc[1,2]='50'

         age      city  salary
name
Alice     25  New York   50000
Bob       30    London   60000
Charlie   35     Tokyo   70000
Diana     28     Paris   55000

In [57]:
df_copy = df_1.copy
df_1.loc['Alice','age']=26
df_1
df_copy

<bound method NDFrame.copy of          age      city salary
name
Alice     26  New York  50000
Bob       30    London     50
Charlie   35     Tokyo  70000
Diana     28     Paris  55000>

### Exercise 2.0:

Using the same DataFrame from Exercise 1

 Task 2: Compare shallow and deep copies

 1. Create a shallow copy called df_shallow

 2. Create a deep copy called df_deep

 3. Modify Bob's city to 'Berlin' in the original DataFrame

 4. Print all three DataFrames and note which copies were affected

In [65]:
df_1
df_shallow = df_1.copy(deep=False)
df_deep = df_1.copy()
df_1.loc['Bob','city']='Berlin'

In [68]:
df_shallow

         age      city  salary
name
Alice     25  New York   50000
Bob       30    Berlin   60000
Charlie   35     Tokyo   70000
Diana     28     Paris   55000

In [67]:
df_deep

         age      city  salary
name
Alice     25  New York   50000
Bob       30    London   60000
Charlie   35     Tokyo   70000
Diana     28     Paris   55000

In [69]:
df_1

         age      city  salary
name
Alice     25  New York   50000
Bob       30    Berlin   60000
Charlie   35     Tokyo   70000
Diana     28     Paris   55000

### Exercise 3.0:
Task 3: Demonstrate the difference between assignment and copying

 1. Create a simple assignment: df_assigned = df

 2. Create a deep copy: df_copied = df.copy()

 3. Change Charlie's salary to 75000 in the original DataFrame

 4. Check which variables reflect this change

In [80]:
df_assignment = df_1
df_copied = df_1.copy()

In [81]:
df_1.loc['Charlie','salary']=75000

In [82]:
df_assignment

         age      city  salary
name
Alice     25  New York   50000
Bob       30    London   60000
Charlie   35     Tokyo   75000
Diana     28     Paris   55000

In [83]:
df_copied

         age      city  salary
name
Alice     25  New York   50000
Bob       30    London   60000
Charlie   35     Tokyo   70000
Diana     28     Paris   55000

### Exercise 4.0:
Imagine you're working with employee data

employees = pd.DataFrame({
    'employee_id': [101, 102, 103, 104],
    'name': ['John', 'Sarah', 'Mike', 'Lisa'],
    'department': ['HR', 'IT', 'Finance', 'Marketing'],
    'salary': [45000, 65000, 55000, 60000],
    'years_experience': [2, 5, 3, 4]
})

employees.set_index('employee_id', inplace=True)

Task: You need to prepare data for a salary analysis without affecting the original

1. Create a copy for analysis

2. In your copy, give all employees a 10% salary increase

3. Verify that the original DataFrame remains unchanged

In [84]:
employees = pd.DataFrame({
    'employee_id': [101, 102, 103, 104],
    'name': ['John', 'Sarah', 'Mike', 'Lisa'],
    'department': ['HR', 'IT', 'Finance', 'Marketing'],
    'salary': [45000, 65000, 55000, 60000],
    'years_experience': [2, 5, 3, 4]
})

In [88]:
employees.set_index('employee_id')

              name department  salary  years_experience
employee_id
101           John         HR   45000                 2
102          Sarah         IT   65000                 5
103           Mike    Finance   55000                 3
104           Lisa  Marketing   60000                 4

In [91]:
employees_10 = employees.copy(deep=True)

In [100]:
increment = ((employees_10.loc[:,'salary']/100)* 10)

In [101]:
employees_10.loc[:,'salary'] = employees_10.loc[:,'salary'] + increment

In [102]:
employees_10

   employee_id   name department  salary  years_experience
0          101   John         HR   49500                 2
1          102  Sarah         IT   71500                 5
2          103   Mike    Finance   60500                 3
3          104   Lisa  Marketing   66000                 4

In [103]:
employees

   employee_id   name department  salary  years_experience
0          101   John         HR   45000                 2
1          102  Sarah         IT   65000                 5
2          103   Mike    Finance   55000                 3
3          104   Lisa  Marketing   60000                 4

### Exercise 5.0
Task 5: Nested modifications

df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

1. Create different types of copies

df2 = df1

df3 = df1.copy()

df4 = df1.copy(deep=False)

2. Modify df1 by adding a new column 'D'

df1['D'] = [10, 11, 12]

3. Which copies will have column 'D'? Test and explain why.

In [107]:
df_5 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

In [108]:
df_5_2 = df_5.copy()
df_5_3 = df_5
df_5_4 = df_5.copy(deep=False)

In [109]:
df_5['D'] = [10,33,4]

In [110]:
df_5_2

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [111]:
df_5_3

   A  B  C   D
0  1  4  7  10
1  2  5  8  33
2  3  6  9   4

In [112]:
df_5_4

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

### Exercise 6.0

Multi-level DataFrame operations

df_original = pd.DataFrame({

    'team': ['A', 'A', 'B', 'B', 'C', 'C'],

    'player': ['P1', 'P2', 'P3', 'P4', 'P5', 'P6'],

    'score': [10, 15, 8, 12, 9, 11],

    'assists': [3, 2, 4, 1, 2, 3]

})

Challenge:

 1. Create a deep copy and modify only specific rows in the copy

 2. Create a shallow copy and modify the original's structure (add/remove columns)

 3. Observe how each copy behaves differently

 4. Write a function that safely modifies data without affecting the original

In [113]:
df_original = pd.DataFrame({
    'team': ['A', 'A', 'B', 'B', 'C', 'C'],
    'player': ['P1', 'P2', 'P3', 'P4', 'P5', 'P6'],
    'score': [10, 15, 8, 12, 9, 11],
    'assists': [3, 2, 4, 1, 2, 3]
})

In [114]:
df_original

  team player  score  assists
0    A     P1     10        3
1    A     P2     15        2
2    B     P3      8        4
3    B     P4     12        1
4    C     P5      9        2
5    C     P6     11        3

In [119]:
deep_copy = df_original.copy()
deep_copy.loc[1,:] =['x','x1',4,7]

In [120]:
deep_copy

  team player  score  assists
0    A     P1     10        3
1    x     x1      4        7
2    B     P3      8        4
3    B     P4     12        1
4    C     P5      9        2
5    C     P6     11        3

In [121]:
deep_shallow_copy_6 = df_original.copy(deep=False)

In [124]:
df_original.iloc[2,:] = ['g','g4',6,8]

In [125]:
df_original

  team player  score  assists
0    A     P1     10        3
1    A     P2     15        2
2    g     g4      6        8
3    B     P4     12        1
4    C     P5      9        2
5    C     P6     11        3

In [127]:
deep_shallow_copy_6

  team player  score  assists
0    A     P1     10        3
1    A     P2     15        2
2    g     g4      6        8
3    B     P4     12        1
4    C     P5      9        2
5    C     P6     11        3

In [129]:
deep_original_copy_99 = df_original.copy()
# function that safely modiffies data without affecting the original